[
  {
    "id": "a1d3f640-91c5-4f62-9b27-1ec8c3331a2e",
    "title": "The Humans",
    "author": "Matt Haig",
    "genre": "Fiction",
    "rating": 4.9,
    "coverUrl": "/images/bookCover/humans.svg",
    "coverColor": "#05676d",
    "description": "A brilliant alien is sent to Earth to inhabit the body of a mathematician and erase a groundbreaking discovery. As he learns more about humanity's quirks, flaws, and beauty, he begins to question his mission and purpose.",
    "totalCopies": 50,
    "availableCopies": 48,
    "summary": "An alien is sent to Earth to erase the discovery of a mathematical breakthrough that could change the course of human evolution. Taking over the body of Professor Andrew Martin, the alien begins his mission with clinical detachment, disgusted by everything about human life—from peanut butter to aging and emotions. But as he navigates Earth, he becomes increasingly drawn to the very chaos he was trained to eliminate.\n\nOver time, he develops unexpected relationships with Andrew’s family, particularly his wife and teenage son. These connections begin to unravel his certainty about his mission and raise new questions about loyalty, love, and what makes life worth living. His observations of human art, music, and vulnerability begin to shift his perception.\n\nWhat begins as a mission of destruction becomes a deeply emotional journey of self-discovery. “The Humans” offers a unique perspective on what it means to be alive—messy, unpredictable, and flawed. Through the eyes of an outsider, Matt Haig explores the beauty and pain of human connection, ultimately reminding readers that our imperfections are what make us most extraordinary."
  },

  {
    "id": "b5fa9c78-4d3e-4b68-8c3b-4a7cf0d0f7c9",
    "title": "How to Stop Time",
    "author": "Matt Haig",
    "genre": "Fiction",
    "rating": 4.9,
    "coverUrl": "/images/bookCover/time.svg",
    "coverColor": "#ff8a3a",
    "description": "Tom Hazard looks like an ordinary 41-year-old, but he's been alive for centuries due to a rare condition. As he tries to live a quiet life as a history teacher in London, the past catches up with him—and so does the possibility of love.",

    "totalCopies": 50,
    "availableCopies": 48,
    "summary": "Tom Hazard suffers from a rare condition that drastically slows down aging, allowing him to live for centuries while appearing to age normally. Over his 400-year lifespan, he's met Shakespeare, sailed with pirates, and witnessed the rise and fall of empires. But his prolonged life has come at a cost—constant reinvention, loss, and an unrelenting loneliness.\n\nIn present-day London, Tom tries to settle into a quiet life as a history teacher, ironically teaching the very moments he's lived through. But the past refuses to let go. Under the control of a secretive society that manages people like him, Tom is given strict rules—never fall in love, never get attached, and never reveal the truth.\n\nAs he falls for a fellow teacher and questions the meaning of his long life, Tom is forced to confront his fears and decide whether a life without love and connection is worth living. “How to Stop Time” is a moving exploration of memory, identity, and the timeless ache of human emotion—reminding us that what we do with time is far more important than how much of it we have."
  },
  {
    "id": "d2c50b9e-9f25-44e4-bdf0-85fa7e2de133",
    "title": "The Life Impossible",
    "author": "Matt Haig",
    "genre": "Fiction",
    "rating": 4.9,
    "coverUrl": "/images/bookCover/impossible.svg",
    "coverColor": "#006ACA",
    "description": "When a man on the edge finds himself in an unexpected house filled with extraordinary people and their impossible lives, he starts to question everything he believed about purpose, pain, and possibility.",

    "totalCopies": 50,
    "availableCopies": 48,
    "summary": "When the weight of life becomes unbearable, a man retreats to the edge of existence—literally and emotionally—only to find himself in a house unlike any other. This mysterious place, perched on a cliff, is inhabited by people whose lives defy the rules of reality. Each resident carries their own impossible story, from suspended time to lives lived in reverse, forming a tapestry of surreal yet deeply human experiences.\n\nAs the man adjusts to the absurdity and wonder of his new surroundings, he begins to unravel the threads of his own trauma and depression. The house serves as a kind of emotional rehabilitation center, where the impossible becomes a metaphor for hope, recovery, and change. Every interaction forces him to rethink the limits of what’s possible—not only in the world but within himself.\n\n“The Life Impossible” challenges readers to look beyond traditional notions of healing and purpose. Through magical realism and heartfelt introspection, Haig weaves a story about survival in the face of despair. The novel ultimately becomes a tribute to resilience and the quiet strength required to continue on, even when life seems beyond comprehension."
  }
]
